@echo off
cls
echo =======================================================
echo Сейчас будет произведенаочистка наиболее вероятных мест
echo хранения данных предыдущих эмуляторов из реестра!
echo =======================================================
echo Продолжить - [Any key]. Отмена - [Ctrl+c]
echo =======================================================
pause
regedit -s UnInstall_old_reg.reg
cls
echo =========================================================
echo Данные предыдущих эмуляторов из реестра были удалены.
echo =========================================================
echo Рекомендуется произвести проверку/чистку реестра вручную!
echo =========================================================
pause